{
  "Header": {
    "about": "Sobre",
    "experience": "Experiência",
    "projects": "Projetos",
    "skills": "Habilidades",
    "education": "Formação",
    "contact": "Contato"
  },
  "HomePage": {
    "title": "Marco Di Toro",
    "subtitle": "Técnico em Telecomunicações | Engenheiro de Software",
    "profilePictureAlt": "Foto de Perfil",
    "aboutMe": "Sobre Mim",
    "aboutMeP1": "Sou técnico em telecomunicações, apaixonado por desenvolvimento de software. Estou sempre adquirindo conhecimento em diversas áreas e aplicando esse aprendizado em meus projetos pessoais.",
    "aboutMeP2": "Atualmente, procuro vaga como estagiário pelo Inatel, para adquirir mais experiência no mercado de trabalho e ser efetivado como engenheiro de software.",
    "professionalExperience": "Experiência Profissional",
    "projects": "Projetos",
    "interestsAndSkills": "Interesses & Skills",
    "education": "Educação",
    "contact": "Contato",
    "linkedin": "LinkedIn",
    "experience1": {
      "role": "Estagiário",
      "company": "Centro de Pesquisas Avançadas Wernher von Braun",
      "duration": "04/2025 - Atual",
      "description": "Desenvolvimento full-stack utilizando o framework ABP com C#. Responsável pela criação de componentes de front-end com Blazor e Blazorise, e pelo desenvolvimento de APIs e lógica de back-end. Utilização de SQL Server para gerenciamento de banco de dados e Postman para testes de API."
    },
    "experience2": {
      "role": "Estagiário",
      "company": "WatchGuard Technologies",
      "duration": "09/2021 - 06/2022 (8 meses)",
      "description": "Trabalhei com microsserviços da AWS e Python, implementando soluções com Lambda, SNS, SQS, S3, Cloudfront, entre outros. Adquiri conhecimentos sobre metodologias ágeis (Scrum) enquanto participava de um time internacional. Obtive muita experiência prática, me proporcionando uma compreensão sólida do desenvolvimento de software em um ambiente profissional ágil."
    },
    "project1": {
      "title": "FETIN 2025: Pixelforge",
      "description": "Um site educacional para alunos de Álgebra Linear e Computação Gráfica visualizarem conceitos vistos em sala de aula de forma prática e interativa."
    },
    "project2": {
      "title": "PROJETE VRTL 2020: Quality control with machine learning",
      "description": "Responsável pelo projeto do 3.º ano técnico. Desenvolvido para linha de produção, com capacidade de identificar, separar e catalogar produtos em tempo real, utilizando uma rede neural treinada."
    },
    "project3": {
      "title": "PROJETE 2019: Baropodômetro",
      "description": "Projeto do 2.º ano técnico. Foi confeccionado um tapete capaz de identificar qual o tipo de pisada do usuário e de sugerir uma possível correção para a mesma."
    },
    "project4": {
      "title": "PROJETE 2018: Portão automático com wi-fi",
      "description": "Projeto do 1.º ano técnico. Portão de garagem, capaz de abrir e fechar automaticamente ao detectar a presença do usuário em sua rede wi-fi local."
    },
    "skills": {
      "frontend": "Frontend",
      "backend": "Backend",
      "qaAndTesting": "QA & Testing",
      "devopsAndCloud": "DevOps & Cloud",
      "unitTesting": "Testes Unitários"
    },
    "education1": {
      "degree": "Engenharia de Software",
      "institution": "Instituto Nacional de Telecomunicações - Inatel",
      "period": "01/2021 – Atual"
    },
    "education2": {
      "degree": "Técnico em Telecomunicações", 
      "institution": "Escola Técnica de Eletrônica Francisco Moreira da Costa",
      "period": "01/2018 - 12/2020"
    },
    "contactSection": {
      "title": "Contato",
      "subtitle": "Vamos trabalhar juntos!",
      "description": "Estou sempre aberto a novas oportunidades e projetos interessantes. Entre em contato comigo através de qualquer um dos canais abaixo.",
      "downloadTitle": "Baixe meu currículo!",
      "downloadDescription": "Baixe uma versão em PDF de meu currículo para referências futuras.",
      "downloadButton": "Download (PDF)"
    },
    "linkedinQRCodeAlt": "QR Code para o LinkedIn",
    "linkedinQRCodeTitle": "Visitar LinkedIn",
    "logoAlt": "logo"
  },
  "footer": {
    "sourceCode": "Código Fonte",
    "privacyPolicy": "Política de Privacidade",
    "termsOfService": "Termos de Serviço",
    "cookiesPolicy": "Política de Cookies",
    "developedWith": "Desenvolvido com Next.js e Tailwind CSS.",
    "navigation": "Navegação",
    "connect": "Conecte-se",
    "about": "Sobre",
    "experience": "Experiência",
    "projects": "Projetos",
    "contact": "Contato"
  },
  "PrivacyPolicy": {
    "title": "Política de Privacidade",
    "introduction": "Este é um site de portfólio pessoal criado para apresentar meu currículo e projetos profissionais.",
    "informationWeCollect": {
      "title": "Informações que Coletamos",
      "p1": "Este site não coleta, armazena ou processa nenhuma informação pessoal dos visitantes. Não há formulários de contato, sistemas de login ou qualquer mecanismo de coleta de dados."
    },
    "howWeUseYourInformation": {
      "title": "Navegação",
      "p1": "Você pode navegar livremente por este site sem fornecer qualquer informação pessoal. Todas as informações exibidas são públicas e relacionadas ao meu perfil profissional."
    },
    "cookies": {
      "title": "Cookies",
      "p1": "Este site utiliza apenas cookies essenciais para funcionalidades básicas, como preferência de idioma e tema (modo claro/escuro). Estes cookies são armazenados localmente no seu navegador e não são compartilhados com terceiros."
    },
    "thirdPartyServices": {
      "title": "Serviços de Terceiros",
      "p1": "Este site não utiliza serviços de terceiros para análise, rastreamento ou publicidade. Não há integração com Google Analytics, Facebook Pixel ou similares."
    },
    "security": {
      "title": "Segurança",
      "p1": "Como não coletamos dados pessoais, não há riscos relacionados ao armazenamento ou vazamento de informações dos visitantes."
    },
    "changesToThisPolicy": {
      "title": "Alterações a Esta Política",
      "p1": "Esta política pode ser atualizada ocasionalmente. Quaisquer alterações serão publicadas nesta página."
    },
    "contactUs": {
      "title": "Contato",
      "p1": "Se você tiver alguma dúvida sobre esta Política de Privacidade, pode entrar em contato através das informações disponíveis na seção de contato do site."
    }
  },
  "TermsOfService": {
    "title": "Termos de Serviço",
    "introduction": "Este é um site de portfólio pessoal de acesso público. Ao acessar este site, você concorda com os seguintes termos.",
    "useOfWebsite": {
      "title": "Uso do Site",
      "p1": "Este site é disponibilizado gratuitamente para fins informativos. Você pode visualizar e navegar pelo conteúdo livremente. O conteúdo apresentado destina-se exclusivamente a demonstrar minha experiência profissional e projetos."
    },
    "intellectualProperty": {
      "title": "Propriedade Intelectual",
      "p1": "O conteúdo deste site, incluindo textos, imagens e design, é de minha autoria. Projetos e trabalhos mencionados podem ter direitos compartilhados com empresas ou instituições onde foram desenvolvidos."
    },
    "disclaimer": {
      "title": "Isenção de Responsabilidade",
      "p1": "As informações neste site são fornecidas 'como estão' para fins informativos. Embora eu me esforce para manter as informações atualizadas e precisas, não ofereço garantias sobre a completude ou exatidão do conteúdo."
    },
    "limitationOfLiability": {
      "title": "Limitação de Responsabilidade",
      "p1": "Este site é apenas um portfólio informativo. Não sou responsável por quaisquer decisões tomadas com base nas informações aqui apresentadas."
    },
    "governingLaw": {
      "title": "Lei Aplicável",
      "p1": "Estes termos são regidos pelas leis brasileiras."
    },
    "changesToTheseTerms": {
      "title": "Alterações a Estes Termos",
      "p1": "Estes termos podem ser atualizados ocasionalmente. Alterações serão publicadas nesta página."
    },
    "contactUs": {
      "title": "Contato",
      "p1": "Se você tiver alguma dúvida sobre estes Termos de Serviço, pode entrar em contato através das informações disponíveis na seção de contato do site."
    }
  },
  "CookiesPolicy": {
    "title": "Política de Cookies",
    "introduction": "Esta Política de Cookies explica como este site utiliza cookies para melhorar sua experiência de navegação.",
    "whatAreCookies": {
      "title": "O que são Cookies?",
      "p1": "Cookies são pequenos arquivos de texto armazenados no seu navegador quando você visita um site. Eles permitem que o site lembre suas preferências e configurações."
    },
    "howWeUseCookies": {
      "title": "Como Usamos os Cookies",
      "p1": "Este site utiliza apenas cookies essenciais armazenados localmente no seu navegador para: (1) Lembrar sua preferência de idioma (português ou inglês), (2) Lembrar sua preferência de tema (modo claro ou escuro). Estes cookies não rastreiam sua atividade, não coletam dados pessoais e não são compartilhados com terceiros."
    },
    "managingCookies": {
      "title": "Gerenciando Cookies",
      "p1": "Você pode limpar os cookies do seu navegador a qualquer momento através das configurações. Se você desabilitar os cookies, suas preferências de idioma e tema não serão salvas entre as visitas ao site."
    },
    "changesToThisPolicy": {
      "title": "Alterações a Esta Política",
      "p1": "Esta política pode ser atualizada ocasionalmente. Alterações serão publicadas nesta página."
    },
    "contactUs": {
      "title": "Contato",
      "p1": "Se você tiver alguma dúvida sobre o uso de cookies neste site, pode entrar em contato através das informações disponíveis na seção de contato."
    }
  }
}