{
  "Header": {
    "about": "Sobre",
    "experience": "Experiência",
    "projects": "Projetos",
    "skills": "Habilidades",
    "education": "Formação",
    "contact": "Contato",
    "login": "Login",
    "logout": "Sair",
    "profile": "Perfil"
  },
  "Profile": {
    "title": "Meu Perfil",
    "name": "Nome",
    "nameLabel": "Nome",
    "namePlaceholder": "Digite seu nome",
    "emailLabel": "Email",
    "emailPlaceholder": "Digite seu endereço de email",
    "image": "Foto de Perfil",
    "imageTypeError": "Tipo de imagem inválido. Selecione um arquivo PNG, JPG ou WEBP.",
    "imageSizeError": "O tamanho da imagem é muito grande. Selecione um arquivo com menos de 1MB.",
    "save": "Salvar Alterações",
    "saving": "Salvando...",
    "loading": "Carregando..."
  },
  "HomePage": {
    "title": "Marco Di Toro",
    "subtitle": "Técnico em Telecomunicações | Engenheiro de Software",
    "profilePictureAlt": "Foto de Perfil",
    "aboutMe": "Sobre Mim",
    "aboutMeP1": "Sou técnico em telecomunicações, apaixonado por desenvolvimento de software. Estou sempre adquirindo conhecimento em diversas áreas e aplicando esse aprendizado em meus projetos pessoais.",
    "aboutMeP2": "Atualmente, procuro vaga como estagiário pelo Inatel, para adquirir mais experiência no mercado de trabalho e ser efetivado como engenheiro de software.",
    "professionalExperience": "Experiência Profissional",
    "projects": "Projetos",
    "interestsAndSkills": "Interesses & Skills",
    "education": "Educação",
    "contact": "Contato",
    "linkedin": "LinkedIn",
    "experience1": {
      "role": "Estagiário",
      "company": "Centro de Pesquisas Avançadas Wernher von Braun",
      "duration": "04/2025 - Atual",
      "description": "Desenvolvimento full-stack utilizando o framework ABP com C#. Responsável pela criação de componentes de front-end com Blazor e Blazorise, e pelo desenvolvimento de APIs e lógica de back-end. Utilização de SQL Server para gerenciamento de banco de dados e Postman para testes de API."
    },
    "experience2": {
      "role": "Estagiário",
      "company": "WatchGuard Technologies",
      "duration": "09/2021 - 06/2022 (8 meses)",
      "description": "Trabalhei com microsserviços da AWS e Python, implementando soluções com Lambda, SNS, SQS, S3, Cloudfront, entre outros. Adquiri conhecimentos sobre metodologias ágeis (Scrum) enquanto participava de um time internacional. Obtive muita experiência prática, me proporcionando uma compreensão sólida do desenvolvimento de software em um ambiente profissional ágil."
    },
    "project1": {
      "title": "FETIN 2025: Pixelforge",
      "description": "Um site educacional para alunos de Álgebra Linear e Computação Gráfica visualizarem conceitos vistos em sala de aula de forma prática e interativa."
    },
    "project2": {
      "title": "PROJETE VRTL 2020: Quality control with machine learning",
      "description": "Responsável pelo projeto do 3.º ano técnico. Desenvolvido para linha de produção, com capacidade de identificar, separar e catalogar produtos em tempo real, utilizando uma rede neural treinada."
    },
    "project3": {
      "title": "PROJETE 2019: Baropodômetro",
      "description": "Projeto do 2.º ano técnico. Foi confeccionado um tapete capaz de identificar qual o tipo de pisada do usuário e de sugerir uma possível correção para a mesma."
    },
    "project4": {
      "title": "PROJETE 2018: Portão automático com wi-fi",
      "description": "Projeto do 1.º ano técnico. Portão de garagem, capaz de abrir e fechar automaticamente ao detectar a presença do usuário em sua rede wi-fi local."
    },
    "skills": {
      "frontend": "Frontend",
      "backend": "Backend",
      "qaAndTesting": "QA & Testing",
      "devopsAndCloud": "DevOps & Cloud",
      "unitTesting": "Testes Unitários"
    },
    "education1": {
      "degree": "Engenharia de Software",
      "institution": "Instituto Nacional de Telecomunicações - Inatel",
      "period": "01/2021 – Atual"
    },
    "education2": {
      "degree": "Técnico em Telecomunicações", 
      "institution": "Escola Técnica de Eletrônica Francisco Moreira da Costa",
      "period": "01/2018 - 12/2020"
    },
    "contactSection": {
      "title": "Contato",
      "subtitle": "Vamos trabalhar juntos!",
      "description": "Estou sempre aberto a novas oportunidades e projetos interessantes. Entre em contato comigo através de qualquer um dos canais abaixo.",
      "downloadTitle": "Baixe meu currículo!",
      "downloadDescription": "Baixe uma versão em PDF de meu currículo para referências futuras.",
      "downloadButton": "Download (PDF)"
    },
    "linkedinQRCodeAlt": "QR Code para o LinkedIn",
    "linkedinQRCodeTitle": "Visitar LinkedIn",
    "logoAlt": "logo"
  },
  "footer": {
    "sourceCode": "Código Fonte",
    "privacyPolicy": "Política de Privacidade",
    "termsOfService": "Termos de Serviço",
    "cookiesPolicy": "Política de Cookies",
    "developedWith": "Desenvolvido com Next.js e Tailwind CSS.",
    "copyright": "Todos os direitos reservados.",
    "navigation": "Navegação",
    "connect": "Conecte-se",
    "about": "Sobre",
    "experience": "Experiência",
    "projects": "Projetos",
    "contact": "Contato"
  },
  "PrivacyPolicy": {
    "title": "Política de Privacidade",
    "introduction": "Esta Política de Privacidade descreve como suas informações pessoais são coletadas, usadas e compartilhadas quando você visita este site.",
    "informationWeCollect": {
      "title": "Informações que Coletamos",
      "p1": "Como este é um site de portfólio simples, não coletamos ativamente informações pessoais dos visitantes. Podemos coletar informações não pessoais que seu navegador envia, como seu endereço IP, tipo de navegador e as páginas que você visita."
    },
    "howWeUseYourInformation": {
      "title": "Como Usamos Suas Informações",
      "p1": "Qualquer informação não pessoal coletada é usada exclusivamente com o propósito de analisar o tráfego do site e melhorar a experiência do usuário. Não vendemos ou compartilhamos essas informações com terceiros."
    },
    "cookies": {
      "title": "Cookies",
      "p1": "Usamos cookies para melhorar sua experiência. Você pode optar por desativar os cookies nas configurações do seu navegador, mas isso pode afetar a funcionalidade do site."
    },
    "thirdPartyServices": {
      "title": "Serviços de Terceiros",
      "p1": "Este site não utiliza serviços de terceiros que coletam informações pessoais."
    },
    "security": {
      "title": "Segurança",
      "p1": "Tomamos precauções razoáveis para proteger suas informações. No entanto, nenhum método de transmissão pela Internet é 100% seguro."
    },
    "changesToThisPolicy": {
      "title": "Alterações a Esta Política",
      "p1": "Podemos atualizar esta política de privacidade de tempos em tempos. Iremos notificá-lo sobre quaisquer alterações, publicando a nova política nesta página."
    },
    "contactUs": {
      "title": "Contato",
      "p1": "Se você tiver alguma dúvida sobre esta Política de Privacidade, entre em contato comigo."
    }
  },
  "TermsOfService": {
    "title": "Termos de Serviço",
    "introduction": "Ao acessar este site, você concorda em cumprir estes termos de serviço, todas as leis e regulamentos aplicáveis ​​e concorda que é responsável pelo cumprimento de quaisquer leis locais aplicáveis.",
    "useOfWebsite": {
      "title": "Uso do Site",
      "p1": "Este site é para seu uso pessoal e não comercial. Você não pode modificar, copiar, distribuir, transmitir, exibir, executar, reproduzir, publicar, licenciar, criar trabalhos derivados, transferir ou vender qualquer informação obtida neste site."
    },
    "intellectualProperty": {
      "title": "Propriedade Intelectual",
      "p1": "Todo o conteúdo deste site, incluindo textos, gráficos, logotipos e imagens, é propriedade do proprietário do site e está protegido por leis de propriedade intelectual."
    },
    "disclaimer": {
      "title": "Isenção de Responsabilidade",
      "p1": "Os materiais neste site são fornecidos 'como estão'. O proprietário do site não oferece garantias, expressas ou implícitas, e por meio deste isenta e nega todas as outras garantias."
    },
    "limitationOfLiability": {
      "title": "Limitação de Responsabilidade",
      "p1": "Em nenhum caso o proprietário do site será responsável por quaisquer danos decorrentes do uso ou da incapacidade de usar os materiais neste site."
    },
    "governingLaw": {
      "title": "Lei Aplicável",
      "p1": "Estes termos e condições são regidos e interpretados de acordo com as leis da jurisdição do proprietário do site, e você se submete irrevogavelmente à jurisdição exclusiva dos tribunais nesse Estado ou localidade."
    },
    "changesToTheseTerms": {
      "title": "Alterações a Estes Termos",
      "p1": "O proprietário do site pode revisar estes termos de serviço para seu site a qualquer momento, sem aviso prévio."
    },
    "contactUs": {
      "title": "Contato",
      "p1": "Se você tiver alguma dúvida sobre estes Termos de Serviço, entre em contato comigo."
    }
  },
  "CookiesPolicy": {
    "title": "Política de Cookies",
    "introduction": "Esta Política de Cookies explica o que são cookies e como os usamos neste site.",
    "whatAreCookies": {
      "title": "O que são Cookies?",
      "p1": "Cookies são pequenos arquivos de texto que são colocados no seu computador ou dispositivo móvel quando você visita um site. Eles são amplamente utilizados para fazer os sites funcionarem de forma mais eficiente e para fornecer informações aos proprietários do site."
    },
    "howWeUseCookies": {
      "title": "Como Usamos os Cookies",
      "p1": "Usamos cookies para melhorar a experiência do usuário em nosso site. Por exemplo, usamos cookies para lembrar sua preferência de idioma. Não usamos cookies para fins de rastreamento ou publicidade."
    },
    "managingCookies": {
      "title": "Gerenciando Cookies",
      "p1": "Você pode controlar e/ou excluir os cookies como desejar. Você pode excluir todos os cookies que já estão no seu computador e pode configurar a maioria dos navegadores para impedir que eles sejam colocados. Se você fizer isso, no entanto, talvez seja necessário ajustar manualmente algumas preferências sempre que visitar um site, e alguns serviços e funcionalidades podem não funcionar."
    },
    "changesToThisPolicy": {
      "title": "Alterações a Esta Política",
      "p1": "Podemos atualizar nossa Política de Cookies de tempos em tempos. Iremos notificá-lo sobre quaisquer alterações, publicando a nova Política de Cookies nesta página."
    },
    "contactUs": {
      "title": "Contato",
      "p1": "Se você tiver alguma dúvida sobre nosso uso de cookies, entre em contato comigo."
    }
  },
  "LoginPage": {
    "title": "Login",
    "emailLabel": "E-mail",
    "passwordLabel": "Senha",
    "emailPlaceholder": "E-mail",
    "passwordPlaceholder": "Senha",
    "loginButton": "Entrar",
    "loading": "Entrando...",
    "forgotPassword": "Esqueceu a senha?",
    "createAccount": "Criar uma conta",
    "backToHome": "Voltar para a Home"
  }
}